{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_755/kernel", "shape": [13, 10], "dtype": "float32"}, {"name": "dense_755/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "dense_756/kernel", "shape": [10, 10], "dtype": "float32"}, {"name": "dense_756/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "dense_757/kernel", "shape": [10, 10], "dtype": "float32"}, {"name": "dense_757/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "dense_758/kernel", "shape": [10, 10], "dtype": "float32"}, {"name": "dense_758/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "dense_759/kernel", "shape": [10, 10], "dtype": "float32"}, {"name": "dense_759/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "dense_760/kernel", "shape": [10, 10], "dtype": "float32"}, {"name": "dense_760/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "dense_761/kernel", "shape": [10, 10], "dtype": "float32"}, {"name": "dense_761/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "dense_762/kernel", "shape": [10, 10], "dtype": "float32"}, {"name": "dense_762/bias", "shape": [10], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "dense_763/kernel", "shape": [10, 5], "dtype": "float32"}, {"name": "dense_763/bias", "shape": [5], "dtype": "float32"}]}]}