{"weightsManifest": [{"weights": [{"name": "dense_1/kernel", "dtype": "float32", "shape": [13, 10]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [10]}], "paths": ["group1-shard1of1"]}, {"weights": [{"name": "dense_2/kernel", "dtype": "float32", "shape": [10, 10]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [10]}], "paths": ["group2-shard1of1"]}, {"weights": [{"name": "dense_3/kernel", "dtype": "float32", "shape": [10, 10]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [10]}], "paths": ["group3-shard1of1"]}, {"weights": [{"name": "dense_4/kernel", "dtype": "float32", "shape": [10, 10]}, {"name": "dense_4/bias", "dtype": "float32", "shape": [10]}], "paths": ["group4-shard1of1"]}, {"weights": [{"name": "dense_5/kernel", "dtype": "float32", "shape": [10, 10]}, {"name": "dense_5/bias", "dtype": "float32", "shape": [10]}], "paths": ["group5-shard1of1"]}, {"weights": [{"name": "dense_6/kernel", "dtype": "float32", "shape": [10, 10]}, {"name": "dense_6/bias", "dtype": "float32", "shape": [10]}], "paths": ["group6-shard1of1"]}, {"weights": [{"name": "dense_7/kernel", "dtype": "float32", "shape": [10, 10]}, {"name": "dense_7/bias", "dtype": "float32", "shape": [10]}], "paths": ["group7-shard1of1"]}, {"weights": [{"name": "dense_8/kernel", "dtype": "float32", "shape": [10, 10]}, {"name": "dense_8/bias", "dtype": "float32", "shape": [10]}], "paths": ["group8-shard1of1"]}, {"weights": [{"name": "dense_9/kernel", "dtype": "float32", "shape": [10, 5]}, {"name": "dense_9/bias", "dtype": "float32", "shape": [5]}], "paths": ["group9-shard1of1"]}], "modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_1", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 13], "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_2", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_constraint": null, "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_3", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_constraint": null, "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_4", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_constraint": null, "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_5", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_constraint": null, "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_6", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_constraint": null, "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_7", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_constraint": null, "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_8", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_constraint": null, "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "units": 5, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_9", "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "bias_constraint": null, "activation": "softmax", "trainable": true}}]}, "keras_version": "2.1.4", "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "optimizer_config": {"class_name": "RMSprop", "config": {"decay": 0.0, "lr": 0.0010000000474974513, "epsilon": 1e-07, "rho": 0.8999999761581421}}, "sample_weight_mode": null}, "backend": "tensorflow"}}